MJmj-kim/Monitoring/nRF5_SDK_15.3.0_59ac345/examples/ble_peripheral/ble_app_uart/main.c
}

void saadc_sampling_event_init(void) 
{
    ret_code_t err_code;

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event every 400ms */
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 1000);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
                                   false);
    nrf_drv_timer_enable(&m_timer);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer,
                                                                                NRF_TIMER_CC_CHANNEL0);

    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_enable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);

    APP_ERROR_CHECK(err_code);
}



void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
  float H,T;
  
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);

        int i;
       // NRF_LOG_INFO("ADC event number: %d", (int)m_adc_evt_counter);

        int VT = p_event->data.done.p_buffer[0];
        int VH =p_event->data.done.p_buffer[1];

        float outdata = (float)VT * 3.6/1023;
        T = -66.875 + 218.75 * outdata/3.3;

        outdata = (float)VH * 3.6/1023;
        H = -12.5 + 125*outdata/3.3;    
       

       /* for debug Humidity*/
        printf("HUMI : %lf %% \n", H);
        printf("ADC event number: %d", p_event->data.done.p_buffer[0]);      
        printf("\n");

        m_adc_evt_counter++; 

      /* when humidity is over 50%  */
         if(H >= 50.0) 
          {
           printf(" Exceeded 50% humidity \n");
           nrf_gpio_pin_set(LED);
          }
          else
          { nrf_gpio_pin_clear(LED); }
    }
   
}


void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config_TEMP =                         //variable modified_temperature
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);  //temperature pin. P0.03(A0)

    nrf_saadc_channel_config_t channel_config_HUMI =                     //variable modified_humidity
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);  //humidity pin. P0.04(A1)

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config_TEMP);   //modified
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(1, &channel_config_HUMI);    //modified
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

}





/* iisdlpc function*/

/**@brief Function for TWI (with transaction manager and twi_sensor) initialization.
 */



static void twi_init(void)
{
    uint32_t err_code;
    
    const nrf_drv_twi_config_t ii_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_MID, // HIGHEST
       .clear_bus_init     = false
    };

    err_code = nrf_twi_mngr_init(&m_nrf_twi_mngr, &ii_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_twi_sensor_init(&m_nrf_twi_sensor);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for connection with the iis2dlpc_read_reg function and nrf52840 SDK.
 * @param[out] return Should be 0.
 */
int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
 nrf_twi_sensor_reg_read(&m_nrf_twi_sensor, II_ADDR, reg, NULL, bufp, len);
 nrf_delay_us(1000);
 NRF_LOG_FLUSH();
 return 0;
}

/**@brief Function for connection with the iis2dlpc_write_reg function and nrf52840 SDK.
 * @param[out] return Should be 0.
 */
int32_t platform_write(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
 nrf_twi_sensor_reg_write(&m_nrf_twi_sensor, II_ADDR, reg, bufp, len);  
 nrf_delay_us(1000);
 NRF_LOG_FLUSH();
 return 0;
}



 void iis2dlpc_read_data_polling(void)
{ 
  
  /* Initialize mems driver interface */
  stmdev_ctx_t dev_ctx;
  dev_ctx.write_reg = platform_write;
  dev_ctx.read_reg = platform_read;
  dev_ctx.handle = NULL;
  /*Initialize platform specific hardware */
  //platform_init();
  
  /* Check device ID */
  nrf_delay_ms(100);

  iis2dlpc_device_id_get(&dev_ctx, &whoamI);
  
  nrf_delay_ms(100);

  if (whoamI != IIS2DLPC_ID)
    while (1) {
     /* manage here device not found */// iis2dlpc_device_id_get(&dev_ctx, &whoamI);
    }

  /*Restore default configuration */
  iis2dlpc_reset_set(&dev_ctx, PROPERTY_ENABLE);

  do {
    iis2dlpc_reset_get(&dev_ctx, &rst);
  } while (rst);

  /* Enable Block Data Update */
  iis2dlpc_block_data_update_set(&dev_ctx, PROPERTY_ENABLE);
  /*Set full scale */
  iis2dlpc_full_scale_set(&dev_ctx, IIS2DLPC_8g);
  /* Configure filtering chain
   * Accelerometer - filter path / bandwidth
   */
  iis2dlpc_filter_path_set(&dev_ctx, IIS2DLPC_LPF_ON_OUT);
  iis2dlpc_filter_bandwidth_set(&dev_ctx, IIS2DLPC_ODR_DIV_4);
  /*Configure power mode */
  //iis2dlpc_power_mode_set(&dev_ctx, IIS2DLPC_HIGH_PERFORMANCE);
  iis2dlpc_power_mode_set(&dev_ctx,
                          IIS2DLPC_CONT_LOW_PWR_LOW_NOISE_12bit);
  /*Set Output Data Rate */
  iis2dlpc_data_rate_set(&dev_ctx, IIS2DLPC_XL_ODR_25Hz);

