MJmj-kim/Monitoring/nRF5_SDK_15.3.0_59ac345/examples/ble_peripheral/ble_app_uart/main.c
  /*Read samples in polling mode (no int) */
  while (1) {
    uint8_t reg;
    /* Read output only if new value is available */
    iis2dlpc_flag_data_ready_get(&dev_ctx, &reg);

    if (reg) {
      /* Read acceleration data */
      memset(data_raw_acceleration, 0x00, 3 * sizeof(int16_t));
      iis2dlpc_acceleration_raw_get(&dev_ctx, data_raw_acceleration);
      acceleration_mg[0] = iis2dlpc_from_fs8_lp1_to_mg(
                             data_raw_acceleration[0]);
      acceleration_mg[1] = iis2dlpc_from_fs8_lp1_to_mg(
                             data_raw_acceleration[1]);
      acceleration_mg[2] = iis2dlpc_from_fs8_lp1_to_mg(
                             data_raw_acceleration[2]);
    
      sprintf((char *)tx_buffer,
              "Acceleration [mg]:%4.2f\t%4.2f\t%4.2f\r\n",
              acceleration_mg[0], acceleration_mg[1], acceleration_mg[2]);
      //printf("check\n");
      nrf_delay_ms(1000);
      printf("%4.2f\t%4.2f\t%4.2f\r\n", acceleration_mg[0], acceleration_mg[1], acceleration_mg[2]);
    }
  }
}





\



/*
static void sendBle(int control_evt)
{
  char msg[7];
  uint8_t control_msg[7];


  sprintf(msg, "%S ", CRIME);


  memcpy(control_msg, msg, sizeof(msg));
  uint16_t length = sizeof(control_msg);
  ble_nus_data_send(&m_nus, control_msg, &length, m_conn_handle);
  printf("message = %s\n", control_msg);
  memset(control_msg, 0, sizeof(msg));
}
*/  




/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();


    /* saadc */
    saadc_init();
    saadc_sampling_event_init();
    saadc_sampling_event_enable();

    NRF_LOG_INFO("SAADC HAL simple example started.");
    NRF_LOG_FLUSH();

    nrf_gpio_cfg_output(LED); // led output set
   

    /*ii2dlpc */    
    
    printf("\r\nTWI master example started. \r\n");
    twi_init();  
    ret_code_t ret_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(ret_code);
    iis2dlpc_read_data_polling(); //dlpc enable
  

    

      
    
    // Enter main loop.
    for (;;)
    {       
        idle_state_handle();
        nrf_pwr_mgmt_run();
        NRF_LOG_FLUSH();
    }
}


/**
 * @}
 */
